#4. Пользователь вводит целое положительное число. Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.

n = int(input('Введите целое положительное число - '))
m = n%10
a = n//10
while a > 0:
    if a%10 > m:
        m = a%10
    a = a//10
print(m)