# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

number = 123 # <class 'int'>
num_ber =12.3 # <class 'float'>
num_ber1 = '123' # <class 'str'>
name = 'Tatyana, Fox, Wolf' # <class 'str'>
logo = True # <class 'bool'>
person = None # <class 'NoneType'>
print(type(number))
print(type(num_ber))
print(type(num_ber1))
print(type(name))
print(type(logo))
print(type(person))