# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

def pay_f():
    num_hours = float(input('Введите количество отработанных часов : '))
    rate_hours = float(input('Введите суммы оплаты труда за 1 час : '))
    bonus = float(input('Укажите размер премии - '))
    return (num_hours*rate_hours) + bonus
print(f'Размер заработной платы составил: {pay_f() }')