#  5. Реализовать формирование списка, используя функцию range() и возможности генератора.
#  В список должны войти четные числа от 100 до 1000 (включая границы).
#  Необходимо получить результат вычисления произведения всех элементов списка.
# Подсказка: использовать функцию reduce().

from functools import reduce

def my_list(num_x,num_y):
    return num_x*num_y

print(f'Список четных значений: {[el for el in range(99,1001) if el%2==0]}')
print(f'Результа перемножения элементов из списка: {reduce(my_list,[el for el in range(99,1001) if el%2==0])}')