# 1. Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
# который должен принимать данные (список списков) для формирования матрицы.
# Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
# Примеры матриц вы найдете в методичке.
# Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
# Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix
# (двух матриц). Результатом сложения должна быть новая матрица.
# Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки первой матрицы
# складываем с первым элементом первой строки второй матрицы и т.д.

class Matrix:
    def __init__(self, my_list):
        self.my_list = my_list

    def __str__(self):
        for list in self.my_list:
            for i in list:
                print(f'{i:4}', end='')
            print()
        return ' '

    def __add__(self, other):
        for i in range(len(self.my_list)):
            for ii in range(len(other.my_list[i])):
                self.my_list[i][ii] = self.my_list[i][ii] + other.my_list[i][ii]
        return Matrix.__str__(self)


my_matrix1 = Matrix(my_list=[[1, 0, -2],[-8, 5, 4], [3, -4, 7], [-3, 0, 1]])
my_matrix2 = Matrix(my_list=[[0, 7, -5],[3, -9, 4], [-2, 8, -6], [1, 2, 0]])
print(my_matrix1.__add__(my_matrix2))